[
  {
    "id": 1,
    "name": "Sigiriya Rock Fortress",
    "province": "Central Province",
    "category": "Historic",
    "description": "Sigiriya, also known as Lion Rock, is an ancient rock fortress located in the central Matale District near the town of Dambulla. This UNESCO World Heritage Site rises 200 meters above the surrounding plains and is famous for its ancient palace ruins, stunning frescoes, and mirror wall. The fortress was built during the reign of King Kashyapa (477-495 CE) and represents one of the best examples of ancient urban planning. The climb to the summit rewards visitors with breathtaking panoramic views of the surrounding countryside and a glimpse into Sri Lanka's rich historical heritage.",
    "image_url": "https://images.pexels.com/photos/13391116/pexels-photo-13391116.jpeg",
    "coordinates": {
      "lat": 7.9568,
      "lng": 80.7592
    }
  },
  {
    "id": 2,
    "name": "Galle Fort",
    "province": "Southern Province",
    "category": "Historic",
    "description": "Galle Fort, a UNESCO World Heritage Site, is a fortified old city founded by Portuguese colonists in the 16th century. The fort was later fortified by the Dutch during the 17th century and stands as the best example of a fortified city built by Europeans in South and Southeast Asia. Walking through its cobblestone streets feels like stepping back in time, with colonial architecture, charming cafes, boutique hotels, and art galleries. The fort offers stunning ocean views, especially during sunset, and houses several museums, churches, and the iconic lighthouse. It's a perfect blend of European colonial architecture and South Asian traditions.",
    "image_url": "https://images.pexels.com/photos/11398731/pexels-photo-11398731.jpeg",
    "coordinates": {
      "lat": 6.0329,
      "lng": 80.2168
    }
  },
  {
    "id": 3,
    "name": "Temple of the Sacred Tooth Relic (Kandy)",
    "province": "Central Province",
    "category": "Religious",
    "description": "The Temple of the Sacred Tooth Relic, located in the royal palace complex of the former Kingdom of Kandy, houses the relic of the tooth of the Buddha. This sacred Buddhist temple is a UNESCO World Heritage Site and one of the most important places of worship for Buddhists worldwide. The temple complex features beautiful Kandyan architecture, intricate woodcarvings, and stunning paintings depicting Buddhist stories. Every year, the temple hosts the Esala Perahera, one of the most spectacular festivals in Asia, featuring traditional dancers, musicians, and decorated elephants. The serene atmosphere and spiritual significance make it a must-visit destination for both pilgrims and tourists.",
    "image_url": "https://images.pexels.com/photos/322437/pexels-photo-322437.jpeg",
    "coordinates": {
      "lat": 7.2906,
      "lng": 80.6337
    }
  },
  {
    "id": 4,
    "name": "Ella Rock & Nine Arch Bridge",
    "province": "Uva Province",
    "category": "Nature",
    "description": "Ella is a small hill country town that has become one of Sri Lanka's most popular destinations, famous for its stunning natural beauty and relaxed atmosphere. The town offers spectacular hiking opportunities, including the trek to Ella Rock, which provides panoramic views of tea plantations and valleys. The iconic Nine Arch Bridge, also known as the Bridge in the Sky, is an architectural marvel built entirely of rock, brick, and cement without using any steel. Train spotting from this bridge is a popular activity, as the blue trains pass through several times daily. Ella is also the gateway to exploring Sri Lanka's tea country, with numerous plantations offering tours and tastings.",
    "image_url": "https://images.pexels.com/photos/8654044/pexels-photo-8654044.jpeg",
    "coordinates": {
      "lat": 6.8700,
      "lng": 81.0467
    }
  },
  {
    "id": 5,
    "name": "Anuradhapura Ancient City",
    "province": "North Central Province",
    "category": "Historic",
    "description": "Anuradhapura, one of the ancient capitals of Sri Lanka, is a UNESCO World Heritage Site and a sacred city for Buddhists around the world. Founded in the 4th century BC, it was the first kingdom and capital of ancient Sri Lanka for over 1,000 years. The city is home to some of the world's oldest Buddhist stupas, including the massive Jetavanaramaya, which was once among the tallest structures in the ancient world. The sacred Bo Tree (Sri Maha Bodhi), grown from a cutting of the original tree under which Buddha attained enlightenment, continues to thrive here after more than 2,000 years. The ruins include palaces, monasteries, and artificial lakes (tanks) that showcase the advanced hydraulic engineering of ancient Sri Lankan civilization.",
    "image_url": "https://images.pexels.com/photos/13667947/pexels-photo-13667947.jpeg",
    "coordinates": {
      "lat": 8.3114,
      "lng": 80.4037
    }
  },
  {
    "id": 6,
    "name": "Nuwara Eliya Tea Country",
    "province": "Central Province",
    "category": "Nature",
    "description": "Nuwara Eliya, known as 'Little England', is a charming hill station located in the heart of Sri Lanka's tea country. At an elevation of 1,868 meters above sea level, it enjoys a cool climate year-round, making it a perfect escape from the tropical heat. The town is surrounded by rolling hills covered with emerald green tea plantations, colonial-era buildings, and beautiful gardens. Visitors can tour working tea factories to learn about the tea-making process and enjoy fresh Ceylon tea tastings. The area offers excellent hiking opportunities, including treks to Single Tree Hill and Lover's Leap waterfall. The colonial architecture, including the Grand Hotel and Hill Club, reflects the town's British heritage and adds to its unique charm.",
    "image_url": "https://images.pexels.com/photos/321570/pexels-photo-321570.jpeg",
    "coordinates": {
      "lat": 6.9497,
      "lng": 80.7891
    }
  },
  {
    "id": 7,
    "name": "Mirissa Beach",
    "province": "Southern Province",
    "category": "Beach",
    "description": "Mirissa is a small coastal town famous for its pristine beaches, vibrant nightlife, and world-class whale watching opportunities. This crescent-shaped bay with golden sandy beaches and swaying coconut palms is considered one of Sri Lanka's most beautiful beaches. From November to April, Mirissa becomes the whale watching capital of Sri Lanka, where visitors can spot blue whales, sperm whales, and dolphins in their natural habitat. The beach offers excellent conditions for surfing, particularly for beginners, with several surf schools available. The laid-back atmosphere, beachside restaurants serving fresh seafood, and stunning sunsets make Mirissa a perfect destination for relaxation. The nearby Coconut Tree Hill provides panoramic views of the coastline and is a popular spot for photography.",
    "image_url": "https://images.pexels.com/photos/11981621/pexels-photo-11981621.jpeg",
    "coordinates": {
      "lat": 5.9449,
      "lng": 80.4690
    }
  },
  {
    "id": 8,
    "name": "Polonnaruwa Archaeological Site",
    "province": "North Central Province",
    "category": "Historic",
    "description": "Polonnaruwa, the second ancient capital of Sri Lanka, is a UNESCO World Heritage Site that showcases some of the finest examples of ancient Sinhalese architecture and sculpture. Serving as the capital from the 11th to 13th centuries, Polonnaruwa contains numerous well-preserved ruins including the Royal Palace complex, the Quadrangle with its collection of ancient structures, and the famous Gal Vihara with its magnificent rock-carved Buddha statues. The city was planned with great attention to urban design, featuring an extensive irrigation system with artificial lakes and canals. The Parakrama Samudraya, a massive artificial reservoir built by King Parakramabahu I, still serves the agricultural needs of the region today. Exploring Polonnaruwa by bicycle is a popular way to cover the extensive archaeological site while enjoying the peaceful rural surroundings.",
    "image_url": "https://images.pexels.com/photos/33171753/pexels-photo-33171753.jpeg",
    "coordinates": {
      "lat": 7.9403,
      "lng": 81.0188
    }
  }
]